// 1) Создайте функцию, которая принимает 1 аргумент (название произвольное)
// Если в качестве аргумента передана не строка - функция оповещает об этом пользователя
// В полученной (как аргумент) строке функция должна убрать все пробелы в начале и в конце
// Если строка более 30 знаков - то после 30го символа часть текста скрывается и вместо них появляются три точки (...)

function anyFunc(acc) {
  if (typeof acc !== 'string') prompt('Дружище, у тебя тут какой-то шлак');
}
return acc.trim().length > 30 ? acc.trim().slice(0, 30) + '...' : acc.trim();
